import { Suspense } from 'react'
import { Link } from 'react-router-dom'
import useDocumentTitle from '@/hooks/useDocumentTitle'
import { LoadingPage } from '@/components/Loading'
import Layout from '@/components/Layout'

const TermsConditions = () => {
  useDocumentTitle('شروط الاستخدام')

  return (
    <Suspense fallback={<LoadingPage />}>
      <Layout>
        <section className='container px-5 mx-auto rtl mb-20'>
          <h1 className='font-bold text-xl text-center mb-10'>شروط الاستخدام</h1>
          <div className='flex flex-col text-justify'>
            <div className='py-3'>
              <h2 className='text-lg font-bold mb-3'>
                مرحبا بك عزيزي في موقع eCommerce!
              </h2>
              <p>
                تحدد هذه الشروط والأحكام القواعد واللوائح الخاصة باستخدام موقع التجارة
                الإلكترونية ، الموجود على موقع
                <Link to='/' className='underline-hover font-bold mr-2 text-base'>
                  eCommerce
                </Link>
              </p>
            </div>
            <div className='py-3'>
              <p>
                من خلال الوصول إلى هذا الموقع ، نفترض أنك تقبل هذه الشروط والأحكام. يفعل
                لا تستمر في استخدام التجارة الإلكترونية إذا كنت لا توافق على أخذ جميع
                الشروط و الشروط المذكورة في هذه الصفحة.
              </p>
            </div>
            <div className='py-3'>
              <h2 className='font-bold mb-3'>الكوكيز</h2>
              <p>
                نحن نستخدم استخدام ملفات تعريف الارتباط. من خلال الوصول إلى التجارة
                الإلكترونية ، فإنك توافق على استخدام ملفات تعريف الارتباط بالاتفاق مع
                سياسة خصوصية التجارة الإلكترونية.
              </p>
              <p>
                تستخدم معظم مواقع الويب التفاعلية ملفات تعريف الارتباط للسماح لنا باسترداد
                تفاصيل المستخدم لكل زيارة. يستخدم موقعنا ملفات تعريف الارتباط لتمكين وظائف
                مناطق معينة لتسهيل زيارة الأشخاص لموقعنا على الويب. بعض من أعمالنا قد
                يستخدم الشركاء التابعون / المعلنون أيضًا ملفات تعريف الارتباط.
              </p>
            </div>
            <div className='py-3'>
              <h2 className='font-bold mb-3'>الترخيص</h2>
              <p>
                ما لم يُنص على خلاف ذلك ، تمتلك التجارة الإلكترونية و / أو المرخصون
                التابعون لها حقوق الملكية الفكرية حقوق الملكية لجميع المواد الموجودة في
                التجارة الإلكترونية. جميع حقوق الملكية الفكرية الحقوق محفوظة. يمكنك الوصول
                إلى هذا من التجارة الإلكترونية لشخصيتك يخضع الاستخدام للقيود المنصوص عليها
                في هذه الشروط والأحكام.
              </p>
            </div>
            <div className='py-3'>
              <h2 className='font-bold mb-3'>الشروط:</h2>
              <ol className='list-decimal space-y-4'>
                <li>
                  المنتجات والخدمات: يوفر الموقع منصة للمستخدمين لشراء المنتجات من بائعين
                  مختلفين. لا يبيع موقع الويب أي منتجات بشكل مباشر ولكنه يعمل كوسيط بين
                  المشترين والبائعين. يوفر الموقع أيضًا خدمات التوصيل للعملاء الذين يشترون
                  المنتجات عبر الموقع.
                </li>
                <li>
                  إنشاء الحساب: يجب على المستخدمين إنشاء حساب على الموقع من أجل شراء
                  المنتجات. يتحمل المستخدمون مسؤولية الحفاظ على سرية معلومات حساباتهم ،
                  بما في ذلك كلمة المرور الخاصة بهم.
                </li>
                <li>
                  معلومات المنتج: يبذل موقع الويب قصارى جهده لتوفير معلومات دقيقة عن
                  المنتج ، بما في ذلك أوصاف المنتج والتسعير. ومع ذلك ، لا يضمن الموقع دقة
                  أو اكتمال هذه المعلومات ، وهو غير مسؤول عن أي أخطاء أو سهو.
                </li>
                <li>
                  الدفع: يقبل الموقع طرق الدفع المختلفة ، بما في ذلك بطاقات الائتمان
                  وأنظمة الدفع عبر الإنترنت. يتحمل المستخدمون مسؤولية ضمان دقة معلومات
                  الدفع الخاصة بهم وحداثتها.
                </li>
                <li>
                  التسليم: يوفر الموقع خدمات التوصيل للمنتجات المشتراة عبر الموقع. قد
                  تختلف أوقات التسليم حسب المنتج وموقع العميل. الموقع غير مسؤول عن أي
                  تأخير أو مشاكل متعلقة بالتسليم.
                </li>
                <li>
                  المرتجعات والمبالغ المستردة: قد يكون المستخدمون مؤهلين للإرجاع أو
                  المبالغ المستردة في حالة تلف المنتجات أو عدم تلبية توقعاتهم. سيوفر
                  الموقع إرشادات حول كيفية طلب الإرجاع أو الاسترداد.
                </li>
                <li>
                  سلوك المستخدم: من المتوقع أن يتصرف المستخدمون بطريقة مهنية ومحترمة عند
                  استخدام الموقع. يحظر على المستخدمين الانخراط في أي نشاط غير قانوني أو
                  غير أخلاقي.
                </li>
                <li>
                  الملكية الفكرية: الموقع ومحتوياته محمية بموجب حقوق النشر وقوانين الملكية
                  الفكرية الأخرى. لا يجوز للمستخدمين نسخ أو إعادة إنتاج أي محتوى من الموقع
                  دون إذن.
                </li>
                <li>
                  تحديد المسؤولية: الموقع غير مسؤول عن أي أضرار أو خسائر قد تنشأ عن
                  استخدام الموقع أو المنتجات والخدمات المقدمة من خلال الموقع.
                </li>
                <li>
                  التغييرات على الشروط والأحكام: قد يقوم موقع الويب بتحديث هذه الشروط
                  والأحكام في أي وقت. سيتم إخطار المستخدمين بأي تغييرات ، وسيكونون مسؤولين
                  عن مراجعة وقبول البنود والشروط المحدثة.
                </li>
              </ol>
            </div>
          </div>
        </section>
      </Layout>
    </Suspense>
  )
}

export default TermsConditions
